[
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Senior Software Engineer, Mobile (Android), Search share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor’s degree or equivalent practical experience. Candidates will typically have 5 years of experience with software development in one or more programming languages, and with data structures/algorithms. Typically 3 years of experience testing, maintaining, or launching software products, and 1 year of experience with software design and architecture. Typically 3 years of experience with Android application development. Preferred qualifications: Master's degree or PhD in Computer Science or related technical field. Candidates will typically have 1 year of experience in a technical leadership role. Experience developing accessible technologies. About the job Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions. In Google Search, we're reimagining what it means to search for information – any way and anywhere. To do that, we need to solve complex engineering challenges and expand our infrastructure, while maintaining a universally accessible and useful experience that people around the world rely on. In joining the Search team, you'll have an opportunity to make an impact on billions of people globally. Responsibilities Write and test product or system development code. Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency). Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback. Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality. Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "affirmative action employer", "educational content", "PhD", "relevant area", "useful experience", "code", "mobile", "generation technologies", "roles", "software design", "deeper expertise", "Experience", "marital status", "feedback", "deliverables", "accommodation", "technical expertise", "accessible technologies", "networking", "projects", "workplace discrimination", "stakeholders", "fees", "Candidate Privacy Policy", "global company", "way", "software development", "equal opportunity", "communication"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Security Engineer III, Product Security share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor's degree in Computer Science, related discipline, or equivalent practical experience. 5 years of experience in the Security field. Experience with Hardware System Architecture. Experience with Firmware. Experience in a Reverse Engineering role. Preferred qualifications: Experience with hardware or firmware security. Understanding of both offensive and defensive security methods. Ability to influence others without authority (especially external parties). Excellent communication and documentation skills. About the job Our Security team works to create and maintain the safest operating environment for Google's users and developers. Security Engineers work with network equipment and actively monitor our systems for attacks and intrusions. In this role, you will also work with software engineers to proactively identify and fix security flaws and vulnerabilities. The Product Security team is within the Cloud CISO organization and is responsible for helping ensure every product Cloud ships is as secure as it can be, and for increasing the assurance levels of security in the infrastructure underlying all Cloud products (which includes hardware/firmware). The OTH-Hardware team within PSE specializes on the hardware underpinning Cloud products. The OTS-HS team has the ambitious strategic mission to protect the world's devices against all hardware and firmware security threats. The OTS Hardware Security team focuses on securing the off-the-shelf hardware/firmware used by Cloud products. We work with a wide range of other external vendors, internal teams, and industry bodies to protect devices against all hardware and firmware security threats. OTS Hardware Security team cares deeply about protecting the hardware/firmware used by Google Cloud products so that the upper layers of the stack can consider it trustworthy. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems. Responsibilities Scope out and identify business critical hardware/firmware devices within Cloud for team review. Perform in-depth and holistic hardware and firmware security review of critical business devices (e.g., HSMs, Servers, Switches, SSDs). Write detailed threat models and reports to support and augment reviews. Present the risk findings and risk mitigation recommendations to technical and organizational leadership across different organizations. Inform vendors of the hardware and firmware vulnerabilities found in their devices. Partner with vendor and internal teams in order to effectively mitigate identified risks. Partner with device vendors to advocate for necessary design changes to hardware and firmware. Design changes due to risk findings both internally and to the vendor. Collaborate closely with team members to come up with new attack scenarios, mitigation, vendor collaboration strategies, and to ensure consistency in team approach and methodology. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "vendor collaboration strategies", "affirmative action employer", "firmware security review", "tools", "relevant area", "Security team", "Hardware System Architecture", "roles", "deeper expertise", "Experience", "partner", "industry bodies", "marital status", "trustworthy", "Servers", "Hardware team", "mitigation", "accommodation", "methodology", "grade solutions", "workplace discrimination", "fees", "Candidate Privacy Policy", "global company", "HS team", "equal opportunity", "communication", "OTS", "attacks"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Data Scientist, Energy Analytics share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Master's degree in Statistics, Data Science, Mathematics, Physics, Economics, Operations Research, Engineering, a related quantitative field, or equivalent practical experience. 3 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or a PhD degree. Preferred qualifications: PhD in Statistics, Engineering, Physics, Mathematics, or a related field. 5 years of work experience using analytics to solve product or business problems, coding (e.g., Python, R, SQL), querying databases or statistical analysis, or a PhD degree. Experience in working or internship as an energy analyst, trader, system operator, etc., including experience applying advanced analytics to energy systems’ planning, control and learning problems within universities, national labs, electric utility companies. Experience with the energy system data. Experience with optimization (e.g., cvx, Gurobi), statistical (e.g., R, Python) software, and database languages (e.g., SQL). About the job At Google, data drives all of our decision-making. Data Scientists work all across the organization to help shape Google's business and technical strategies by processing, analyzing, interpreting huge data sets, as well as coming up with new algorithmic and statistical approaches that improve performance and efficiency of Google-wide systems. As an energy analyst, you will collaborate with Google’s Climate Operations team, Energy and Policy Strategists, Engineers and Product Managers to adjust Google's energy systems and practices based on your findings. You will apply an understanding of energy systems and market dynamics, optimization and statistical knowledge, as well as the coding experience, to develop methods to solve and assess the cutting edge problems related to carbon and efficiency aware compute shifting, grid integration, energy asset forecasting and scalable control. You will work broadly with different energy stakeholders across the organization and drive innovation of our energy systems stack, while improving its efficiency and global environmental impact. As an Energy Analytics Data Scientist, you will think critically and strategically about Google’s fleet-wide energy assets, cloud as a technology, business and its operation, while thinking about its impact on the environment as a whole. Responsibilities Lead projects with energy system, market analysis and carbon impact analysis, modeling and optimization, drawing from multiple problem solving methods and energy domain expertise to choose the right tool and right level of complexity appropriate for the business challenges. Engage broadly with the organization to identify, prioritize, frame, and structure complex and ambiguous challenges arising in the energy domain, where advanced analytics projects or tools can have the high impact. Identify and communicate the challenges and opportunities that the group should be working on. Articulate business questions and use mathematical techniques to arrive at an answer using data. Translate analysis results into business recommendations. Help define the problem solving direction and influence the direction of the associated engineering and infrastructure work. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "modeling", "affirmative action employer", "Python", "PhD", "tools", "relevant area", "prioritize", "energy domain", "roles", "right level", "direction", "data", "statistical approaches", "advanced analytics projects", "deeper expertise", "Data Scientist", "Experience", "structure complex", "marital status", "decision", "wide energy assets", "accommodation", "planning", "workplace discrimination", "Responsibilities Lead projects", "fees", "Candidate Privacy Policy", "global company", "Mathematics"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Principal Engineer, AI, Trust, Security, Site Reliability Engineering share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Director+ Apply share link Copy link email Email a friend Minimum qualifications: Bachelor's degree in Computer Science, similar technical field, or equivalent practical experience. Experience in technical leadership and setting technical direction for engineering projects. Experience in architecting, designing, and developing distributed systems. Preferred qualifications: Experience developing and implementing technical programs in security and/or AI engineering or product/platform design. Leadership experience in the security, reliability and resilience space. Experience having impact over a large-scale of users. Experience leading and implementing engineering projects at an executive level within multinational and distributed organizations. Experience partnering and leading by influence, as well as working with stakeholders and collaborating across organizational boundaries. Understanding of compute, networking, application stacks, and supporting product features, services, and technologies. About the job Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible. Responsibilities Create the reality of a stable, secure, and trustworthy integrated cloud AI platform for a diverse pool of customers and workloads worldwide. Balance feature velocity with reliability, security, and cost efficiency. Partner with a wide and diverse array of teams working in the Cloud AI, Security, and Sovereign Workloads space to set the technical direction for AI, trust, and security. Challenge our approach and status quo to elevate our platform reliability, security, and resilience beyond our current capabilities. Contribute to our most complex technical projects and externally visible product decisions, using your technical acumen, problem-solving abilities, and good judgment to help build scalable and future-proof Google systems. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["affirmative action employer", "Cloud AI", "Site Reliability Engineering share link Copy link email Email", "organizations", "roles", "visible product decisions", "Sovereign Workloads space", "fastest experience possible", "Experience", "proof Google systems", "marital status", "trustworthy", "accommodation", "networking", "workplace discrimination", "stakeholders", "fees", "Candidate Privacy Policy", "global company", "executive level", "Google platforms", "equal opportunity", "best", "communication", "AI engineering", "related condition", "trust", "Technical Infrastructure team", "Google place Zürich", "friend"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Software Engineer III, Infrastructure, YouTube share link Copy link email Email a friend corporate_fare YouTube place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor’s degree or equivalent practical experience. 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree. 2 years of experience with data structures or algorithms in either an academic or industry setting. 2 years of experience building and developing large-scale infrastructure, distributed systems or networks, or experience with compute technologies, storage, or hardware architecture. Preferred qualifications: Master's degree or PhD in Computer Science or related technical fields. Experience developing accessible technologies. About the job Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions. At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together. Responsibilities Write product or system development code. Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies. Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency). Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback. Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "affirmative action employer", "educational content", "PhD", "relevant area", "YouTube share link Copy link email Email", "code", "mobile", "generation technologies", "roles", "deeper expertise", "Experience", "voice", "marital status", "experience building", "feedback", "YouTube", "deliverables", "accommodation", "technical expertise", "accessible technologies", "networking", "projects", "workplace discrimination", "stakeholders", "fees", "Candidate Privacy Policy", "global company", "software development", "hardware architecture"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Product Manager II, Commerce share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor's degree or equivalent practical experience. 5 years of experience in product management or related technical role. 2 years of experience taking technical products from conception to launch. Preferred qualifications: Master's degree in a technology or business related field. 3 years of experience in a business function or role (e.g., strategic marketing, business operations, consulting). 3 years of experience in a role preparing and delivering technical presentations to senior leadership. 2 years of experience in software development or engineering. 2 years of experience working cross-functionally with engineering, UX/UI, sales, finance, and other stakeholders. 1 year of experience in technical leadership. About the job At Google, we put our users first. The world is always changing, so we need Product Managers who are continuously adapting and excited to work on products that affect millions of people every day. In this role, you will work cross-functionally to guide products from conception to launch by connecting the technical and business worlds. You can break down complex problems into steps that drive product development. One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. Our team works closely with creative engineers, designers, marketers, etc. to help design and develop technologies that improve access to the world's information. We're responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting, and tailoring our solutions to our users. Google is an engineering company at heart. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on users around the world. At Google, engineers not only revolutionize search, they routinely work on scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, social to local, Google engineers are changing the world one technological achievement after another. Responsibilities Work with partner teams (e.g., engineers, PgMs, UX) during product design and development to implement the requirements to turn PRDs into OKRs for one or more teams. Define product roadmaps by operationalizing strategy. Develop and secure buy-in for a product vision that identifies, defines, and supports the overall product narrative and direction, achieving an outcome that is greater than the sum of its parts. Validate the market size and opportunity (e.g., user-based, strategic opportunity, revenue). Drive launches, maintenance, and retirement in collaboration with other cross-functional teams and stakeholders. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["Product Manager II", "share link Copy link email Email", "technical products", "affirmative action employer", "relevant area", "many reasons Google", "technological achievement", "storage solutions", "product roadmaps", "roles", "retirement", "business function", "direction", "deeper expertise", "senior leadership", "marital status", "partner teams", "strategic marketing", "excited", "execution cycle", "YouTube", "ready", "accommodation", "workplace discrimination", "in", "stakeholders", "fees", "Candidate Privacy Policy", "PgMs", "global company"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Analytical Consultant, Large Customer Sales (English, German) share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor's degree or equivalent practical experience. 5 years of industry experience in digital advertising, consultative sales, business development, or digital marketing, or 3 years of experience with an advanced degree. Ability to communicate in English and German fluently to interact with German speaking customers. Preferred qualifications: Experience in translating complex data analyses into business recommendations via structured analysis frameworks and compelling presentation story-lines whether at the practitioner or executive level of a client's organization. Experience with marketing analytics, return on investment/financial modeling and statistical analysis, with knowledge of measurement and statistics. Experience with digital marketing and website analytics platforms and Knowledge of marketing or advertising evaluation gained at business, consulting firms or agencies. Experience working with Python, with strong data visualization skills. Ability to work effectively in fast-paced environments with effective time-management and prioritization skills. Interest in data, metrics, analysis and trends. About the job Being an Analyst at Google is about much more than simply crunching numbers – it’s about finding compelling insights within data and using your exceptional business and communication skills to translate those insights into action. As one of the masterminds behind our strategic planning, forecasting and analysis, you’ll spend your time digging into big, complex data sets. The data will not remain inert in your hands, however, since you’ll use your critical thinking, problem solving and communication skills to influence and drive thoughtful and well-informed decision making with our most senior business leaders within the organization, and potentially some of our biggest clients. Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences. Responsibilities Use technical expertise to develop automated and actionable solutions that are aligned with the customer’s marketing objectives helping clients in online marketing. Use knowledge of data analytics and predictive and statistical modeling techniques to develop smart, integrated, research-based proposals to enhance Google's reputation with clients as a consultant and partner. Own and develop internal and client-facing reporting infrastructure. Work with the team and client stakeholders in order to help them understand how Google data can be paired with their internal business intelligence to improve performance. Build trusted relationships with clients to help influence key decision makers at all levels. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "Google data", "financial modeling", "investment", "Python", "effective time", "client stakeholders", "affirmative action employer", "relevant area", "mobile", "roles", "strong data visualization skills", "data", "communication skills", "reputation", "deeper expertise", "Experience", "masterminds", "partner", "marital status", "complex data sets", "Interest", "decision", "accommodation", "technical expertise", "consultative sales", "workplace discrimination", "fees", "Candidate Privacy Policy", "global company"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Enterprise Account Manager, Google Cloud (English) share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Advanced Advanced Experience owning outcomes and decision making, solving ambiguous problems and influencing stakeholders; deep expertise in domain. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor's degree or equivalent practical experience. 10 years of sales experience in the technology industry with SaaS, PaaS, or IaaS products and platforms. Experience working with clients in the Banking, Financial Services, Capital Markets segment, or similar. Experience engaging with accounts, selling a portfolio of products at C-level. Experience leading software sales and account management for organizations. Ability to communicate in English fluently in order to interact with international stakeholders. Preferred qualifications: Experience promoting infrastructure software, databases, analytic tools, or applications software. Experience working with and managing partners in complex implementation projects. Experience with large commercial and legal agreements working with procurement, legal, and business teams in large enterprises. Ability to work with sales engineers and customers technical leads to inventory existing software estates, define migration plans, and build business cases for migrations. Ability to communicate in German fluently in order to interact with local stakeholders. About the job The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems. Responsibilities Build executive relationships with Banking and Capital Markets clients in Switzerland. Influence long-term strategic direction and serve as a business partner. Discuss and manage the entire business cycle, often presenting to C-level executives. Lead account strategy in generating and developing business growth opportunities. Work collaboratively with Customer Engineers and Google Partners in order to optimize business results in the territory, and open up opportunities within the customer base. Understand each customer’s technology footprint, strategic growth plans and business drivers, technology strategy, and engaged landscape. Drive business development, forecast accurately, and achieve goals by leading customers through the entire business cycle. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "affirmative action employer", "tools", "international stakeholders", "term strategic direction", "Switzerland", "organizations", "procurement", "roles", "technology footprint", "Experience", "partner", "marital status", "large enterprises", "accommodation", "grade solutions", "workplace discrimination", "stakeholders", "fees", "Candidate Privacy Policy", "global company", "small", "customer base", "equal opportunity", "communication", "partners", "next", "related condition", "Google place Zürich", "friend"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Research Engineer, Self-Organizing Systems share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor’s degree or equivalent practical experience. 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree. 2 years of experience in implementing Machine Learning algorithms or techniques (e.g., basics of automatic differentiation) and in using Machine Learning frameworks (e.g., Jax, PyTorch, Triton). One or more scientific publication submission(s) in Artificial Life conferences (e.g., ALIFE, GECCO, NeurIPS), journals and repositories or equivalent publications in similar fields such as Machine Learning, Mathematics or Physics. Preferred qualifications: PhD in Computer Science or a related technical field. Experience in using Google Collaboratory or similar interactive Integrated Development Environments (IDEs) to disseminate and share research work in progress. Experience in deep learning, evolutionary strategies, or reinforcement learning. Experience owning and initiating research agendas. Knowledge of linear algebra, statistics, and calculus relating to the underlying principles of Artificial Intelligence algorithms. Ability to conduct independent research, exploring unconventional ideas in the field of Artificial Life. About the job Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. In this role, you will be performing research on self-organizing systems, in a Research team which conducts both theoretical and empirical research in neural computation and fundamentally rethinking approaches to intelligence. Their activity involves improving, leveraging, and benchmarking emerging substrates for intelligence, using models such as Neural Cellular Automata, memory-local compute paradigms and novel/niche approaches exhibiting complexification and open-endedness to achieve this goal. They are exploring and building paradigms of intelligence that either scale exceptionally well on existing hardware or easily map to new hardware. Google Research is building the next generation of intelligent systems for all Google products. To achieve this, we’re working on projects that utilize the latest computer science techniques developed by skilled software developers and research scientists. Google Research teams collaborate closely with other teams across Google, maintaining the flexibility and versatility required to adapt new projects and foci that meet the demands of the world's fast-paced business needs. Responsibilities Develop machine learning code, interactive demos or prototypes to assess the feasibility and performance of potential research ideas involving advances in creating in-silico intelligence with real-life utility. Contribute to research publications in the form of articles as well as publications in traditional venues. Implement theoretical brainstorming and experimentation in code or hardware. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "IDEs", "Neural Cellular Automata", "affirmative action employer", "silico intelligence", "PhD", "relevant area", "skilled software developers", "Machine Learning", "code", "mobile", "generation technologies", "roles", "deeper expertise", "Experience", "Jax", "marital status", "demands", "prototypes", "substrates", "accommodation", "networking", "projects", "workplace discrimination", "fees", "Candidate Privacy Policy", "global company", "latest computer science techniques", "new hardware", "software development"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Research Scientist, 3D Generative AI and Neural Representations share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: PhD degree in Computer Science, a related field, or equivalent practical experience. Experience in computer vision and machine learning related to 3D computer vision. One or more scientific publication submission(s) for conferences, journals, or public repositories. Preferred qualifications: 2 years of experience in coding. 1 year of experience owning and initiating research agendas. Experience in 3D reconstruction. Experience with generative AI models. Knowledge of coding with Python. About the job As an organization, Google maintains a portfolio of research projects driven by fundamental research, new product innovation, product contribution and infrastructure goals, while providing individuals and teams the freedom to emphasize specific types of work. As a Research Scientist, you'll setup large-scale tests and deploy promising ideas quickly and broadly, managing deadlines and deliverables while applying the latest theories to develop new and improved products, processes, or technologies. From creating experiments and prototyping implementations to designing new architectures, our research scientists work on real-world problems that span the breadth of computer science, such as machine (and deep) learning, data mining, natural language processing, hardware and software performance analysis, improving compilers for mobile platforms, as well as core search and much more. As a Research Scientist, you'll also actively contribute to the wider research community by sharing and publishing your findings, with ideas inspired by internal projects as well as from collaborations with research programs at partner universities and technical institutes all over the world. Google Research addresses challenges that define the technology of today and tomorrow. From conducting fundamental research to influencing product development, our research teams have the opportunity to impact technology used by billions of people every day. Our teams aspire to make discoveries that impact everyone, and core to our approach is sharing our research and tools to fuel progress in the field -- we publish regularly in academic journals, release projects as open source, and apply research to Google products. Responsibilities Author research papers to share and generate impact of research results across the team and in the research community. Develop innovative computer vision and machine learning technology for applications in the field of augmented reality and beyond. Lead productionization of innovative computer vision and machine learning technology in the area of 3D Generative AI and 3D neural representations, including development and optimization of the machine learning model, integration in a mobile framework, hillclimb, and evaluation. Establish and maintain relationships with main stakeholders and keep recurring updates on the advancements of the project, making sure that their expectations are aligned to the research and engineering work. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["improved products", "share link Copy link email Email", "updates", "Python", "affirmative action employer", "such", "technical institutes", "tools", "relevant area", "fundamental research", "new", "roles", "deeper expertise", "Experience", "research community", "marital status", "partner universities", "machine learning", "area", "software performance analysis", "public repositories", "deliverables", "accommodation", "workplace discrimination", "data mining", "promising ideas", "fees", "Candidate Privacy Policy", "global company", "research"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Quantitative UX Researcher, Ads share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor's degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, related field, or equivalent practical experience. 4 years of experience in an applied research setting, or similar. Experience in programming languages used for data manipulation and computational statistics (Python, R, MATLAB, C++, Java, Go), and with SQL. Product research experience in an applied research setting. Include a portfolio , website, or any other relevant link to your work in your resume (providing a viewable link and/or access instructions). Preferred qualifications: Master's or PhD degree in Human-Computer Interaction, Cognitive Science, Statistics, Psychology, Anthropology, or related field. 3 years of experience working with senior leadership (e.g., Director level and above). 2 years of experience conducting UX research on products, managing projects, and working in a large, matrixed organization. Excellent command of research questions within a given domain, and of technical tools for the analysis of data within that field. Proficiency in programming computational and statistical algorithms for large data sets. Demonstrated expertise in descriptive, inferential, and multivariate statistics, including t-test and ANOVA, and experimental design. About the job At Google, we follow a simple but vital premise: \"Focus on the user and all else will follow.\" Quantitative User Experience Researchers make this possible. Google User Experience (UX) is made up of multi-disciplinary teams of UX Designers, Researchers, Writers, Content Strategists, Program Managers, and Engineers who care deeply about the people who use our products. The UX team plays an integral part in gathering insights about the attitudes, emotions, needs, and behaviors of people who use our products to inspire and inform design. We collaborate closely with each other and with engineering and product management to create industry-leading products that deliver value for the people who use them, and for Google’s businesses. As a Quantitative User Experience Researcher (Quant UXR), you’ll help inform your team of UXers, product managers, and engineers about user needs. You’ll play a critical role in creating useful, usable, and delightful products. You’ll work with stakeholders across functions and levels and have impact at all stages of product development. You will investigate user behavior and user needs using empirical research methods such as logs analysis, survey research, path modeling, and regression analysis. Quant UXRs vary in background using skills from computer science, quantitative social science, econometrics, data science, survey research, psychology, human-computer interaction, and other fields. You’ll combine skills in behavioral research design, statistical methods, and general programming to improve user experience. The Quant UXR community at Google will help you do your best work. You’ll have the opportunity to work with and learn from UXRs across Google through regular meetups, mentor programs, and access to internal research tools. User experience is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to gather insights that inform product strategy and design. Our UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and simplicity. We work on collaborative teams to solve complex challenges and craft experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.” Responsibilities Define and measure quantitative UX goals and metrics in collaboration with Designers, Qualitative Researchers, Data Scientists, Engineers and Program Managers. Develop code and statistical models to understand user experience. Conduct empirical research using methods from computer science, quantitative social science, statistics, econometrics, and other fields to understand user behavior and extract meaningful patterns from large data sets. Examine existing data and product designs to generate hypotheses and plans for high-impact research. Prioritize and drive research to improve user experience. Communicate findings to stakeholders in the company. Make research findings convincing and actionable for both research experts and non-experts. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["emotions", "share link Copy link email Email", "access instructions", "simple", "Python", "affirmative action employer", "relevant area", "Anthropology", "website", "code", "background", "roles", "data", "complex challenges", "deeper expertise", "Experience", "senior leadership", "marital status", "actionable", "ANOVA", "computational statistics", "key principle", "resume", "research findings convincing", "accommodation", "user behavior", "projects", "Product research experience", "workplace discrimination", "stakeholders"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Software Engineer II, Search Ads Retrieval share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Early Early Experience completing work as directed, and collaborating with teammates; developing knowledge of relevant concepts and processes. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor's degree or equivalent practical experience. 1 year of experience with data structures or algorithms. Experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). Preferred qualifications: Experience with natural language processing or machine learning. About the job Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. At Google, our users come first, and the Systems Infrastructure team is at the heart of that promise. We build the technologies that transform the way we think about doing business. Whether working on our cloud systems, researching the latest in computer technology or keeping Google's internal systems humming, Googlers and users alike rely on us to keep things running. We're back-end experts: protecting your privacy and ensuring your security. Responsibilities Analyze available data about advertisers and users. Propose how we could use the data to improve our systems for the benefit of advertisers, users, and Google. Implement and evaluate prototypes all the way from data ingestion, through adding signals to our retrieval model and training it to running live experiments and evaluating their impact. Participate in productionizing the system by automating it and making it debuggable and monitored. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "affirmative action employer", "Python", "available data", "Switzerland bar_chart Early Early Experience", "mobile", "generation technologies", "Propose", "roles", "advertisers", "data", "Experience", "marital status", "machine learning", "prototypes", "accommodation", "networking", "projects", "workplace discrimination", "fees", "Candidate Privacy Policy", "global company", "way", "software development", "equal opportunity", "communication", "privacy", "next", "related condition", "areas"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Software Engineer II, Search Ads, Infrastructure share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Early Early Experience completing work as directed, and collaborating with teammates; developing knowledge of relevant concepts and processes. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor's degree or equivalent practical experience. 1 year of experience with data structures or algorithms. Experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript). Preferred qualifications: Familiarity with large-scale distributed systems, and applications in Search or Ads. About the job Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. At Google, our users come first, and the Systems Infrastructure team is at the heart of that promise. We build the technologies that transform the way we think about doing business. Whether working on our cloud systems, researching the latest in computer technology or keeping Google's internal systems humming, Googlers and users alike rely on us to keep things running. We're back-end experts: protecting your privacy and ensuring your security. Responsibilities Own projects from initial idea to design, analysis, and implementation. Understand production systems, and visualize, monitor, and optimize performance. Stay up-to-date regarding the latest tools and developments in infrastructure. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "affirmative action employer", "Python", "Switzerland bar_chart Early Early Experience", "mobile", "generation technologies", "roles", "Experience", "marital status", "accommodation", "networking", "projects", "workplace discrimination", "fees", "Candidate Privacy Policy", "global company", "way", "software development", "analysis", "equal opportunity", "communication", "privacy", "next", "monitor", "related condition", "areas", "Google place Zürich", "Search", "friend", "Infrastructure share link Copy link email Email"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Software Engineer, Machine Learning, Gemini share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor’s degree in Computer Science, or equivalent practical experience. 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree. 2 years of experience with data structures or algorithms. 2 years of experience with machine learning algorithms and tools (e.g., TensorFlow), artificial intelligence, deep learning, or natural language processing. Preferred qualifications: PhD in Machine Learning or a related field. Experience with Supervised Fine-Tuning (SFT) and Reinforcement Learning with Human Feedback (RLHF). Experience working with Large Language Models (LLMs). Ability to grow under pressure in high-stakes, high-visibility environments. Excellent data analysis skills. About the job Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. The team is working on all Multimodal efforts across Gemini. We launched image retrieval, image understanding and generation. This includes a significant amount of deep modeling such as Supervised Fine-Tuning (SFT), Reinforcement Learning with Human Feedback (RLHF), and iterative process optimization (IPO) establishing data flywheel, etc. Part of the team is also involved in building necessary infrastructure and landing multimodal model capabilities and features. In this role, you will have significant external impact, offering tremendous potential for growth and increased responsibility. A conversational AI tool that enables users to collaborate with generative AI and help augment their imagination, expand their curiosity, and enhance their productivity. Responsibilities Collaborate with Research teams to understand technologies, adapting and integrating them into Gemini/Bard to drive continuous improvement. Leverage Supervised Fine-Tuning (SFT), Reinforcement Learning with Human Feedback (RLHF), and Preference Optimization (IPO) to quality hill climb. Conduct in-depth data analysis to uncover insights, pinpoint opportunities, and inform the strategic development of a data flywheel. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "affirmative action employer", "depth data analysis", "tools", "PhD", "relevant area", "features", "Machine Learning", "mobile", "generation technologies", "roles", "deeper expertise", "Experience", "marital status", "imagination", "accommodation", "networking", "projects", "workplace discrimination", "fees", "Candidate Privacy Policy", "global company", "software development", "equal opportunity", "communication", "next", "related condition", "areas", "Google place Zürich", "friend"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Software Engineer III, AI/ML share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor’s degree or equivalent practical experience. 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree. 2 years of experience with data structures or algorithms. Experience in coding and Machine Learning (ML). Experience in Computer Vision. Preferred qualifications: Experience with software development in C++. About the job Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. Responsibilities Write product or system development code. Improve the signals and understand the query of Google Lens. Develop and evaluate image embedding of lens quality. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "affirmative action employer", "relevant area", "Machine Learning", "mobile", "generation technologies", "roles", "deeper expertise", "Experience", "marital status", "ML share link Copy link email Email", "accommodation", "networking", "projects", "workplace discrimination", "fees", "Candidate Privacy Policy", "global company", "Computer Vision", "software development", "equal opportunity", "communication", "next", "related condition", "areas", "Google place Zürich", "friend", "problems", "Responsibilities", "web search"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Senior Security Engineer, Product Security Engineering share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Mid Mid Experience driving progress, solving problems, and mentoring more junior team members; deeper expertise and applied knowledge within relevant area. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor's degree in Computer Science, a related field, or equivalent practical experience. Experience with Hardware System Architecture. Experience with Reverse Engineering. Experience with Firmware. Experience in the Security field. Preferred qualifications: Experience with hardware or firmware security. Understanding of both offensive and defensive security methods. Ability to influence others without authority. Excellent communication and documentation skills. About the job Our Security team works to create and maintain the safest operating environment for Google's users and developers. Security Engineers work with network equipment and actively monitor our systems for attacks and intrusions. In this role, you will also work with software engineers to proactively identify and fix security flaws and vulnerabilities. The Product Security Engineering (PSE) team within the Cloud CISO organization is responsible for helping ensure every product Cloud ships is as secure as it can be and for increasing the assurance levels of security in the infrastructure underlying all Cloud products, including hardware/firmware. The Off the Shelf (OTS) Hardware Security team within PSE specializes in the hardware underpinning Cloud products. The OTS Hardware Security team has the ambitious strategic mission to protect the world's devices against all hardware and firmware security threats. Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems. Responsibilities Identify business critical hardware/firmware devices within Cloud for team review. Perform in-depth and holistic hardware and firmware security review of critical business devices (e.g., Hardware Security Modules, Servers, Switches, Solid State Drives). Write detailed threat models and reports to support and augment reviews. Present the risk findings and risk mitigation recommendations to technical and organizational leadership across different organizations. Inform vendors of the hardware and firmware vulnerabilities found in their devices. Partner with vendor and internal teams in order to effectively mitigate identified risks. Partner with device vendors to advocate for necessary design changes to hardware and firmware. Collaborate with team members to come up with new attack scenarios, mitigation, vendor collaboration strategies, and to ensure consistency in team approach and methodology. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "vendor collaboration strategies", "affirmative action employer", "firmware security review", "tools", "relevant area", "Shelf", "Security team", "Hardware System Architecture", "roles", "deeper expertise", "Experience", "partner", "marital status", "Servers", "Hardware Security team", "mitigation", "accommodation", "methodology", "grade solutions", "workplace discrimination", "fees", "Candidate Privacy Policy", "global company", "equal opportunity", "communication", "OTS", "attacks", "team members", "related condition"]},
{"JobLocationCity": "Zürich", "JobLocationLocality": "Zürich", "JobLocationCountry": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationCountryCode": "ch", "JobLocation": "Schweiz/Suisse/Svizzera/Svizra", "JobLocationText": "Schweiz/Suisse/Svizzera/Svizra", "CleanContent": " Staff Software Engineer, Machine Learning, Gemini share link Copy link email Email a friend corporate_fare Google place Zürich, Switzerland bar_chart Advanced Advanced Experience owning outcomes and decision making, solving ambiguous problems and influencing stakeholders; deep expertise in domain. Apply share link Copy link email Email a friend Minimum qualifications: Bachelor's degree or equivalent practical experience. 8 years of experience in software development, and with data structures/algorithms. 5 years of experience testing, and launching software products, and 3 years of experience with software design and architecture. 5 years of experience with Machine Learning (ML) models, ML infrastructure, Natural Language Processing or Computer Vision. Preferred qualifications: Master’s degree or PhD in Engineering, Computer Science, or a related technical field. 3 years of experience in a technical leadership role leading project teams and setting technical direction. 3 years of experience working in a complex, matrixed organization involving cross-functional or cross-business projects. Experience with Supervised Fine-Tuning (SFT) and Reinforcement Learning with Human Feedback (RLHF). Experience developing, launching products, or technologies with LLMs. Demonstrated data analysis skills. About the job Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. A conversational AI tool that enables users to collaborate with generative AI and help augment their imagination, expand their curiosity, and enhance their productivity. Responsibilities Write product or system development code. Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency). Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback. Work with research to understand SOTA technology and make adjustments/improvements to fit Gemini. Conduct in-depth data analysis to uncover insights, pinpoint opportunities, and inform the strategic development of a data flywheel. Information collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy . Google is proud to be an equal opportunity and affirmative action employer. We are committed to building a workforce that is representative of the users we serve, creating a culture of belonging, and providing an equal employment opportunity regardless of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or related condition (including breastfeeding), expecting or parents-to-be, criminal histories consistent with legal requirements, or any other basis protected by law. See also Google's EEO Policy , Know your rights: workplace discrimination is illegal , Belonging at Google , and How we hire . If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form . Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles unless stated otherwise in the job posting. To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees, or any other organization location. Google is not responsible for any fees related to unsolicited resumes. ", "Skills": ["share link Copy link email Email", "cross - business projects", "affirmative action employer", "depth data analysis", "educational content", "PhD", "Machine Learning", "code", "mobile", "generation technologies", "roles", "software design", "Experience", "marital status", "imagination", "feedback", "accommodation", "networking", "projects", "workplace discrimination", "stakeholders", "fees", "Candidate Privacy Policy", "global company", "Computer Vision", "software development", "research", "equal opportunity", "communication", "next"]}
]